In [3]:
# Dependencies and Setup
import pandas as pd

# Create path to data files
data_path = 'data/LTS CHURN CASE STUDY_Updated.xlsx'

In [8]:
# Read the Job Slots dataset using the openpyxl library
data_df = pd.read_excel(data_path, engine = 'openpyxl')
data_df.head()

,COMPANY,DATE,JOB_ID,JOB_FUNCTION,JOB_REGION,JOB_IMPRESSIONS,JOB_VIEWS,JOB_APPLICATIONS,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,Company_ABC,2019-01-01,4022.0,Marketing,Asia Pacific,240.0,9.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
1,Company_ABC,2019-01-01,6211.0,Human Resources,Latin America,203.0,9.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
2,Company_ABC,2019-01-01,4538.0,Engineering,Europe,119.0,3.0,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
3,Company_ABC,2019-01-02,2583.0,Support,Asia Pacific,687.0,1.0,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0
4,Company_ABC,2019-01-02,3266.0,Human Resources,North America,314.0,16.0,8.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,0.0

In [7]:
# Get the dimensions, number of rows and columns, of the DataFrame
data_df.shape

(36484, 19)

In [6]:
# Count non-NA cells in each column
data_df.count()

COMPANY             22979
DATE                22979
JOB_ID              22979
JOB_FUNCTION        22979
JOB_REGION          22979
JOB_IMPRESSIONS     22979
JOB_VIEWS           22979
JOB_APPLICATIONS    22979
Unnamed: 8              0
Unnamed: 9              0
Unnamed: 10             0
Unnamed: 11             0
Unnamed: 12             0
Unnamed: 13             0
Unnamed: 14             0
Unnamed: 15             0
Unnamed: 16          1506
Unnamed: 17          1506
Unnamed: 18          1506
dtype: int64

In [9]:
# Remove empty rows
data_v2_df = data_df[data_df['COMPANY'].notna()]

# Remove empty columns
dataset_df = data_v2_df.drop(data_v2_df.filter(regex = 'Unnamed').columns, axis = 1)

In [15]:
# Count non-NA cells in each column
dataset_df.count()

COMPANY             22979
DATE                22979
JOB_ID              22979
JOB_FUNCTION        22979
JOB_REGION          22979
JOB_IMPRESSIONS     22979
JOB_VIEWS           22979
JOB_APPLICATIONS    22979
dtype: int64

In [26]:
# Check the data types in the DataFrame
dataset_df.dtypes

COMPANY                     object
DATE                datetime64[ns]
JOB_ID                     float64
JOB_FUNCTION                object
JOB_REGION                  object
JOB_IMPRESSIONS            float64
JOB_VIEWS                  float64
JOB_APPLICATIONS           float64
dtype: object

In [30]:
# Add a Year column and extract values from the Date column
dataset_df['Year'] = dataset_df['DATE'].dt.year
dataset_df.head()

,COMPANY,DATE,JOB_ID,JOB_FUNCTION,JOB_REGION,JOB_IMPRESSIONS,JOB_VIEWS,JOB_APPLICATIONS,Year
0,Company_ABC,2019-01-01,4022.0,Marketing,Asia Pacific,240.0,9.0,1.0,2019
1,Company_ABC,2019-01-01,6211.0,Human Resources,Latin America,203.0,9.0,1.0,2019
2,Company_ABC,2019-01-01,4538.0,Engineering,Europe,119.0,3.0,3.0,2019
3,Company_ABC,2019-01-02,2583.0,Support,Asia Pacific,687.0,1.0,3.0,2019
4,Company_ABC,2019-01-02,3266.0,Human Resources,North America,314.0,16.0,8.0,2019

In [23]:
# Count the number of job postings per region
region_group_df = dataset_df.groupby(['JOB_REGION']).count()

# Pull values in first column and rename columns in new DataFrame
regional_cnt_df = pd.DataFrame(region_group_df.iloc[:, 0])
regional_cnt_df.rename(columns  = {"COMPANY":"Total Postings"}, inplace = True)
regional_cnt_df

               Total Postings
JOB_REGION
Asia Pacific             5886
Europe                   5647
Latin America            5857
North America            5589

In [36]:
# Count the number of job postings per region
region_group_df = dataset_df.groupby(['JOB_REGION', 'Year']).count()

# Pull values in first column and rename columns in new DataFrame
regional_cnt_df = pd.DataFrame(region_group_df.iloc[:, 0])
regional_cnt_df.rename(columns  = {"COMPANY":"Total Postings"}, inplace = True)
regional_cnt_df

                    Total Postings
JOB_REGION    Year
Asia Pacific  2019            2910
              2020            2967
              2021               9
Europe        2019            2754
              2020            2886
              2021               7
Latin America 2019            2873
              2020            2979
              2021               5
North America 2019            2662
              2020            2921
              2021               6